window.companions=[
	'الأحمري',
	'الأحوص بن عبد بن أمية',
	'الأحوص بن مسعود بن كعب',
	'الأخرم الهجيمي',
	'الأخضر بن أبي الأخضر الأنصاري',
	'الأخنس السلمي',
	'الأخنس بن شريق بن عمرو',
	'الأدرع السلمي',
	'الأرقم الجني',
	'الأرقم بن أبي الأرقم',
	'الأزرق بن عقبة',
	'الأسفع البكري',
	'الأسفع الجرمي',
	'الأسقع والد واثلة بن الأسقع',
	'الأسلع الأعرجي',
	'الأسود بن البختري بن خويلد',
	'الأسود بن أبي الأسود النهدي',
	'الأسود بن أصرم المحاربي',
	'الأسود بن ثعلبة اليربوعي',
	'البراء بن عازب',
	'البراء بن معرور',
	'الحارث بن الحارث',
	'الحارث بن ربعي',
	'الحارث بن العباس',
	'الحارث بن الطفيل بن صخر',
	'الحارث بن الحباب',
	'الحارث بن أسد',
	'الحارث بن هشام الجهني',
	'الحسن بن علي',
	'الحسين بن علي',
	'الزبير بن العوام',
	'العاص بن هاشم بن الحارث',
	'العباس بن عبد المطلب',
	'العلاء بن الحضرمي',
	'القاسم بن محمد',
	'القعقاع بن عمرو',
	'الفضل بن العباس',
	'المغيرة بن شعبة',
	'المقداد بن عمرو',
	'المقدام بن معدي كرب',
	'النابغة الجعدي',
	'النعمان بن بشير',
	'الوازع أبو ذريح',
	'الوازع بن الزارع',
	'الوازم بن زر',
	'الوليد بن القاسم',
	'الوليد بن الوليد بن المغيرة',
	'الوليد بن جابر',
	'الوليد بن زفر',
	'الوليد بن عبادة',
	'الوليد بن عبد شمس',
	'الوليد بن عقبة',
	'الوليد بن عمارة',
	'الوليد بن قيس',
	'اليمان بن جابر',
	'أبان بن سعيد بن العاص',
	'أبرهة بن الصباح الحبشي',
	'أبرهة بن شرحبيل',
	'أبو الدرداء الأنصاري',
	'أبو العاص بن الربيع',
	'أبو أمامة الباهلي',
	'أبو أيوب الأنصاري',
	'أبو بكر الصديق',
	'أبو ذر الغفاري',
	'أبو زمعة البلوي',
	'أبو سعيد الخدري',
	'أبو سفيان بن الحارث',
	'أبو سفيان بن حرب',
	'أبو طلحة',
	'أبو عبيدة عامر بن الجراح',
	'أبو موسى الأشعري',
	'أبو هريرة',
	'أبي بن أمية بن حرثان',
	'أبي بن القشب الأزدي',
	'أبي بن ثابت الأنصاري',
	'أبي بن شريق',
	'أبي بن عجلان الباهلي',
	'أبي بن عمار',
	'أبي بن كعب بن عبد ثور المزني',
	'أبي بن كعب بن قيس',
	'أبي بن مالك القشيري',
	'أبي بن معاذ بن أنس',
	'أبي حميد الساعدي',
	'أبيض الجني',
	'أبيض بن أسود',
	'أبيض بن حمال',
	'أبيض بن عبد الرحمن بن النعمان',
	'أبيض بن هنى بن معاوية',
	'أثال بن النعمان الحنفي',
	'أثبج العبدي',
	'أثيلة الخزاعي',
	'أحمر أبو عسيب',
	'أحمر بن سليم',
	'أحمر بن سواء بن عدي',
	'أحمر بن قطن الهمداني',
	'أحمر بن مازن بن أوس',
	'أحمر بن معاوية بن سليم',
	'أحمر مولى أم سلمة',
	'أحيحة بن أمية بن خلف',
	'أدهم بن حظرة اللخمي الراشدي',
	'أذينة بن سلمة بن الحارث',
	'أربد بن جبير',
	'أرطاة بن كعب بن شراحيل',
	'أرقم بن أبي الأرقم',
	'أزهر بن حميضة',
	'أزهر بن عبد عوف',
	'أزهر بن منقر',
	'أسامة الحنفي',
	'أسامة بن أخدري التميمي',
	'أسامة بن زيد بن حارثة',
	'أسامة بن شريك الثعلبي',
	'أسامة بن عمير بن عامر',
	'أسد بن حارثة الكلبي',
	'أسد بن خويلد',
	'أسد بن سعية القرظي',
	'أسد بن عبد الله',
	'أسد بن كرز بن عامر البجلي',
	'أسد بن كعب القرظي',
	'أسد مولى رسول الله',
	'أسعد بن حرام الخزرجي',
	'أسعد بن زرارة',
	'أسعد بن سلامة الأشهلي',
	'أسعد بن عبد الله بن مالك',
	'أسعد بن عطية بن عبيد',
	'أسعد بن يربوع الأنصاري',
	'أسعد بن يزيد بن الفاكه',
	'أسلم الراعي الأسود',
	'أسلم الطائي',
	'أسلم بن الحارث بن عبد المطلب',
	'أسلم بن بجرة',
	'أسلم بن جبيرة بن حصين',
	'أسلم بن عميرة',
	'أسماء بن حارثة بن سعيد',
	'أسماء بن خالد البارقي',
	'أسماء بن ربان بن معاوية',
	'أسماء بن مالك الكعبي',
	'أسيد بن حضير',
	'أنس بن النضر',
	'أنس بن مالك',
	'أوس بن ثابت',
	'إبراهيم الطائفي',
	'إبراهيم بن جابر',
	'إبراهيم بن عباد بن أساف',
	'إبراهيم بن قيس بن حجر',
	'إبراهيم بن محمد',
	'إساف بن أنمار السلمي',
	'إسحاق الغنوي',
	'إسماعيل بن سعيد بن عبيد',
	'إسماعيل بن عبد الله الغفاري',
	'ازداد بن فساءة الفارسي',
	'ازيهر مولى سهيل بن عمرو',/*

	'براء بن مالك',
	'برح بن عسكر',
	'بلال بن رباح',
	'ثابت بن الدحداح',
	'ثابت بن زيد بن وديعة',
	'ثعلبة بن عبد الرحمن',
	'ثابت بن عامر',
	'جابر بن عبد الله',
	'جابر بن عياش',
	'جبير بن مطعم',
	'جرير بن عبد الله البجلي',
	'جعفر بن أبي سفيان',
	'جعفر بن أبي طالب',
	'جندب بن زهير',
	'جندب بن كعب',
	'جندب بن عبد الله البجلي',
	'حاطب بن أبي بلتعة',
	'حابس بن دغنة الكلبي',
	'حبيب بن ربيعة',
	'حدرجان بن مالك',
	'حذيفة الأزدي البارقي',
	'حذيفة بن اليمان',
	'حذيفة بن محصن البارقي',
	'حسان بن ثابت',
	'حمزة بن عبد المطلب',
	'حميضة بن النعمان البارقي',
	'حنظلة بن أبي عامر',
	'حبيب العنزي',
	'خالد بن الوليد',
	'خالد بن العنبس',
	'خالد بن سعيد بن العاص',
	'خباب بن الأرت',
	'خباب والد عطاء',
	'خبيب بن عدي',
	'خطيم',
	'دحية بن خليفة الكلبي',
	'رافع بن خَديج',
	'زهير بن سليم',
	'زيد الخير',
	'زيد بن ثابت',
	'زيد بن حارثة',
	'زيد بن خالد الجهني',
	'زيد بن سهل الأنصاري',
	'زيد بن الخطاب',
	'سالم مولى أبي حذيفة',
	'سارية بن زنيم',
	'سعد بن أبي وقاص',
	'سعد بن عبادة',
	'سعد بن معاذ',
	'سعيد بن زيد',
	'سفيان بن عوف',
	'سلمان الفارسي',
	'سهل بن سعد',
	'سهيل بن عمرو',
	'شرحبيل بن حسنة',
	'صخر بن وادعة',
	'صفوان بن أمية',
	'صيفي بن الأسلت',
	'ضرار بن الأزور',
	'طارق بن شهاب البجلي',
	'طلحة بن عبيد الله',
	'طفيل بن عمرو الدوسى',
	'عامر بن واثلة',
	'عباد بن بشر',
	'عبادة بن الصامت',
	'عبد الرحمن بن عوف',
	'عبد الرحمن بن سمرة',
	'عبد الله بن الزبير',
	'عبد الله بن أبي السرح',
	'عبد الله بن أم مكتوم',
	'عبد الله بن حوالة الأزدي',
	'عبد الله بن بحينة',
	'عبد الله بن رواحة',
	'عبد الله بن سلام',
	'عبد الله بن عباس',
	'عبد الله بن عمر بن الخطاب',
	'عبد الله بن عمرو بن العاص',
	'عبد الله بن عمرو بن حرام',
	'عبد الله بن مسعود',
	'عثمان بن طلحة',
	'عثمان بن عفان',
	'عثمان بن مظعون',
	'عقيل بن أبي طالب',
	'عكاشة بن مِحصن الأسدي',
	'علي بن أبي طالب',
	'عمار بن ياسر',
	'عمر بن الخطاب',
	'عمران بن حصين',
	'عمرو بن الجموح',
	'عمرو بن الحمق',
	'عمرو بن العاص',
	'عروة بن عياض البارقي',
	'عمرو بن معد يكرب',
	'عكرمة بن أبي جهل',
	'فاتك بن زيد',
	'فاتك بن عمرو',
	'الفاكه بن بشر',
	'فرات بن حيان',
	'فراس بن حابس',
	'كعب بن عجرة',
	'كعب بن مالك',
	'لبيد بن ربيعة العامري',
	'مخنف بن سليم',
	'مدرك بن الحارث',
	'مثنى بن حارثة',
	'مسلمة بن مخلد الأنصاري',
	'مصعب بن عمير',
	'معاذ بن جبل',
	'معاوية بن أبي سفيان',
	'معاوية بن خديج',
	'محمد بن مسلمة',
	'محمود بن مسلمة',
	'هاشم بن عتبة',
	'وائل القيل',
	'وائل بن أبي القعيس',
	'وائل بن حجر',
	'وابصة بن معبد',
	'واثلة بن الأسقع',
	'واثلة بن الخطاب',
	'واسع بن حبان',
	'واصلة بن حباب',
	'واقد أبو مرواح',
	'واقد بن الحارث',
	'واقد بن عبد الله',
	'واقد',
	'وبر بن مشهر',
	'وبر بن يحنس',
	'وجز بن غالب',
	'وحشي بن حرب',
	'وحوج بن الأسلت',
	'وداعة بن أبي زيد',
	'وداعة بن أبي وداعة',
	'وداعة بن خذام',
	'ودان بن زر',
	'ودفة بن إياس',
	'وديعة بن خذام',
	'وديعة بن عمرو',
	'ورد بن خالد السلمي',
	'وردان الجني',
	'وردان بن إسماعيل',
	'وردان بن مخرم',
	'وردان جد الفرات',
	'وردان مولى رسول الإسلام',
	'ورقة بن حابس',
	'ورقة بن نوفل',
	'وزر بن سدوس',
	'وعلة بن يزيد',
	'وفرة بن نافر البعاثي',
	'وقاص بن قمامة',
	'وقاص بن مجزر',
	'وهب الجيشاني',
	'وهب بن الأسود',
	'وهب بن السماع',
	'وهب بن أبي سرح',
	'وهب بن أمية',
	'وهب بن حذيفة',
	'وهب بن حمزة',
	'وهب بن خنبش',
	'وهب بن خويلد',
	'وهب بن زمعة',
	'وهب بن سعد',
	'وهب بن عبد الله بن قارب',
	'وهب بن عبد الله بن محصن',
	'وهب بن عبد الله بن مسلم',
	'وهب بن عمرو الأسدي',
	'وهب بن عمير',
	'وهب بن قابوس',
	'وهب بن قيس',
	'وهب بن كلدة',
	'وهب بن معقل',
	'وهب والد عثمان',
	'وهبان بن صيفي',
	'ياسر بن عامر',
	'يامين بن يامين',
	'يثربي بن عوف',
	'يحنس بن وبرة',
	'يحيى بن الحنظلية',
	'يحيى بن أسعد بن زرارة',
	'يحيى بن أسيد',
	'يحيى بن حكيم',
	'يحيى بن خلاد',
	'يحيى بن سعيد',
	'يحيى بن صيفي',
	'يحيى بن عبد الرحمن',
	'يحيى بن عمير',
	'يحيى بن نفير',
	'يحيى بن هانىء',
	'يحيى بن هند',
	'يربوع أبو الجعد',
	'يزداد الفارسي',
	'يزيد العقيلي',
	'يزيد أبو السائب الأزدي',
	'يزيد أبو السائب الكندي',
	'يزيد أبو عبد الرحمن',
	'يزيد أبو عمر',
	'يزيد أبو معن',
	'يزيد أبو هانئ',
	'يزيد بن الأخنس',
	'يزيد بن الأسود العامري',
	'يزيد بن الأصم',
	'يزيد بن الجراح',
	'يزيد بن الحارث',
	'يزيد بن السكن الأنصاري',
	'يزيد بن السكن بن رافع',
	'يزيد بن المحجل',
	'يزيد بن المزين',
	'يزيد بن المنذر',
	'يزيد بن النعمان',
	'يزيد بن أبي زياد',
	'يزيد بن أبي منصور',
	'يزيد بن أسد بن كرز البجلي',
	'يزيد بن أسيد',
	'يزيد بن أسير',
	'يزيد بن أمية',
	'يزيد بن أنيس',
	'يزيد بن أوس',
	'يزيد بن برذع',
	'يزيد بن بهرام',
	'يزيد بن تميم',
	'يزيد بن ثابت',
	'يزيد بن ثعلبة',
	'يزيد بن جارية',
	'يزيد بن حاطب',
	'يزيد بن حذيفة',
	'يزيد بن حرام',
	'يزيد بن حصين',
	'يزيد بن حمزة',
	'يزيد بن حوثرة',
	'يزيد بن خالد العصري',
	'يزيد بن خدارة',
	'يزيد بن رقيش',
	'يزيد بن ركانة',
	'يزيد بن زمعة',
	'يزيد بن زيد',
	'يزيد بن سلمة الجعفي',
	'يزيد بن سلمة الضمري',
	'يزيد بن سنان',
	'يزيد بن سيف',
	'يزيد بن شجرة',
	'يزيد بن شراحيل',
	'يزيد بن شريح',
	'يزيد بن شريك',
	'يزيد بن شيبان الأزدي',
	'يزيد بن صحار',
	'يزيد بن ضمرة',
	'يزيد بن طعمة',
	'يزيد بن طلحة',
	'يزيد بن طلق',
	'يزيد بن ظبيان',
	'يزيد بن عامر الأنصاري',
	'يزيد بن عامر السوائي',
	'يزيد بن عبابة',
	'يزيد بن عبد',
	'يزيد بن عبد الله',
	'يزيد بن عبد الله البجلي',
	'يزيد بن عبد الله الكندي',
	'يزيد بن عبد الله بن الجراح',
	'يزيد بن عبد الله بن الشخير',
	'يزيد بن عبد المدان',
	'يزيد بن عتر',
	'يزيد بن عمرو',
	'يزيد بن عمرو التميمي',
	'يزيد بن عمرو الأنصاري',
	'يزيد بن عمير',
	'يزيد بن قتادة',
	'يزيد بن قنافة',
	'يزيد بن قيس',
	'يزيد بن قيس الظفري',
	'يزيد بن قيس الكندي',
	'يزيد بن قيس أخو سعيد',
	'يزيد بن قيس بن خارجة',
	'يزيد بن كعب',
	'يزيد بن مالك الجعفي',
	'يزيد بن مالك أبو سبرة',
	'يزيد بن مربع',
	'يزيد بن معبد',
	'يزيد بن مهار خسرو',
	'يزيد بن نعامة',
	'يزيد بن نعيم',
	'يزيد بن نويرة',
	'يزيد بن وقش',
	'يزيد بن يحنس',
	'يزيد والد الحجاج',
	'يزيد، والد حكيم',
	'يزيد الخطمي',
	'يسار الحبشي',
	'يسار الخفاف',
	'يسار الراعي',
	'يسار أبو فكيهة',
	'يسار أبو هند الحجام',
	'يسار بن الأطول',
	'يسار بن أزيهر',
	'يسار بن بلال',
	'يسار بن سبع',
	'يسار بن سويد',
	'يسار بن عبد',
	'يسار، جد محمد بن إسحاق',
	'يسار مولى المغيرة بن شعبة',
	'يسار مولى أبي الهيثم',
	'يسار مولى عمرو',
	'يسار، مولى فضالة بن هلال',
	'يسر بن الحارث',
	'يسير بن العنبس',
	'يسير بن عمرو',
	'يسير بن عمرو الكندي',
	'يعقوب القبطي',
	'يعقوب بن الحصين',
	'يعقوب بن أوس',
	'يعقوب بن زمعة',
	'يعلى',
	'يعلى العامري',
	'يعلى بن أمية',
	'يعلى بن حارثة',
	'يعلى بن حمزة',
	'يعلى بن مرة',
	'يعمر السعدي',
	'يعيش الجهني',
	'يعيش بن طخفة',
	'يعيش غلام بني المغيرة',
	'يفوذان بن يفديدويه',
	'يناق جد الحسن بن مسلم',
	'يوسف الفهري',
	'يوسف بن عبد اله بن سلام',
	'يونس أبو محمد الظفري',
	'سلمه بن سعد العنزي'*/
	];

window.all_letters=['أ','ب','ت','ث','ج','ح','خ','د','ذ','ر','ز','س','ش','ص','ض','ط','ظ','ع','غ','ف','ق','ك','ل','م','ن','ﮬ','و','ي'];
window.numbers=['٠','١','٢','٣','٤','٥','٦','٧','٨','٩'];
function construct(){
	var d=new Date();
	window.t=d.getTime();
	$('#face').attr('onclick', 'return false;');
	$('#face').css('left', '25px');
	$('#dialog').css('left', '100px');
	$('#dialog').css('top', '120px');
	$('#dialog').html('سأقوم باختيار اسم صحابي من بين ٤٧٩ صحابياً عشوائياً<br>وأنت عليك معرفة اسم الصحابي الجليل');
	setTimeout(function(){
		$('#dialog').removeClass('ani');
		$('#dialog').html('ولكن...');
		$('#dialog').css('top', '145px');
		$('#gallows').fadeIn(2000);
		setTimeout(function(){
			$('#dialog').html('في كل مرة تخطئ؛ سيتم رسم جزء من المشنقة!<br>عليك معرفة الصحابي قبل اكتمال رسمها');
			$('#dialog').css('top', '120px');
			start();
			setTimeout(function(){
				$('#dialog').html('املأ الفراغات لتشكيل اسم الصحابي');
				$('#dialog').css('top', '145px');
				$('#guess').slideDown(2000);
				setTimeout(function(){
					$('#keyboard').slideDown(2000);
					$('#dialog').html('اضغط على الأحرف لتشكيل الاسم');
					setTimeout(function(){
						$('#dialog').html('فلنبدأ على بركة الله');
					}, 3000);
				}, 3000);
			}, 4000);
		}, 2000);
	}, 5000);
	return false;	
}
function start(){
	window.trails=0;
	window.c=0;
	window.i=getRand();
	window.name=getName();
	window.letters=window.name.split("");
	window.s=(window.name.replace(/\s/g, '')).length;
	fillLetters();
	fillKeyboard();
}
function getRand(){
	return Math.floor(window.t*Math.random()%151);//Math.floor((Math.random()*479));
}
function getName(){
	return window.companions[window.i];
}
function fillLetters(){
	$('#guess').html('الصحابي الجليل: ');
	for(var i=0; i<window.letters.length; i++){
		if(letters[i]==' '){
			$('#guess').append('<div class="space"></div>');
		}else{
			$('#guess').append('<div id="l'+(i+1)+'"></div>');
		}
	};
	$('#guess').append('<div id="utter"></div>');
}
function fillKeyboard(){
	$('#keyboard').html('');
	for(var i=0; i<window.all_letters.length; i++){
		$('#keyboard').append('<div id="k'+(i+1)+'" onclick="checkLetter(\''+window.all_letters[i]+'\'); return false;">'+window.all_letters[i]+'</div>');
	};
}
function checkLetter(l){
	if(window.trails==6)return false;
	var match=0;
	if(l=='ﮬ')l='ه';
	for(var i=0; i<window.letters.length; i++){
		if(window.letters[i]==l || (l=='أ' && window.letters[i]=='ا')  || (l=='أ' && window.letters[i]=='إ')  || (l=='أ' && window.letters[i]=='ء') || (l=='أ' && window.letters[i]=='ئ') || (l=='و' && window.letters[i]=='ؤ') || (l=='ي' && window.letters[i]=='ى') || (l=='ه' && window.letters[i]=='ة')){
			$('#l'+(i+1)).html(window.letters[i]);
			match++;
			window.c++;
		}
	};
	if(l=='ه')l='ﮬ';
	if(!match){
		$('#s'+(window.trails+2)).slideDown();
		window.trails++;
		$('#face').addClass('e'+window.trails);
		$('#k'+(window.all_letters.indexOf(l)+1)).addClass('no');
		$('#dialog').html('لا يوجد تطابق للحرف ”'+l+'“');
	}else{
		$('#k'+(window.all_letters.indexOf(l)+1)).addClass('yes');
		var m=window.numbers[match]+' '+'تطابقات';
		if(match==1)m='تطابق';
		else if(match==2)m='تطابقين';
		$('#dialog').html('يوجد '+m+' للحرف ”'+l+'“');
		if(window.c==window.s){
			$('#keyboard div').attr('onclick', 'return false');
			setTimeout(function(){
				$('#dialog').html('أحسنت');
				removeEmotions();
				$('#face').addClass('done');
				setTimeout(function(){
					$('#dialog').html('الصحابي الجليل '+window.name);
					$('#bio').html(window.bios[window.i]);
					$('#bio').slideDown('slow');
					setTimeout(function(){
						$('#face').attr('onclick', 'retry(); return false;');
						$('#dialog').html('اضغطني لتلعب مرة أخرى');
					}, 6000);
				}, 2500);
			}, 1000);
			return false;
		}
	}
	$('#k'+(window.all_letters.indexOf(l)+1)).addClass('dis');
	$('#k'+(window.all_letters.indexOf(l)+1)).attr('onclick', '$("#dialog").html("لقد اخترت هذا الحرف من قبل");return false;');
	if(window.trails==6){
		$('#keyboard div').attr('onclick', 'return false');
		setTimeout(function(){
			$('#dialog').html('لم تحزر');
			setTimeout(function(){
				fillName();
				$('#dialog').html('الاسم الصحيح: '+window.name);
				$('#bio').html(window.bios[window.i]);
				$('#bio').slideDown('slow');
				setTimeout(function(){
					removeEmotions();
					$('#face').attr('onclick', 'retry(); return false;');
					$('#dialog').html('اضغطني لتلعب مرة أخرى');
				}, 6000);
			}, 2500);
		}, 1000);
	}
}
function fillName(){
	for(var i=0; i<window.letters.length; i++){
		$('#l'+(i+1)).html(window.letters[i]);
	}
}
function removeEmotions(){
	for(var i=window.trails; i>0; i--){
		$('#face').removeClass('e'+i);
	};
}
function retry(){
	$('#face').attr('onclick', 'return false;');
	$('#bio').slideUp(1000);
	setTimeout(function(){
		$('#face').removeClass('done');
		$('#guess').slideUp(1000);
		setTimeout(function(){
			$('#gallows').fadeOut(1000);
			$('#keyboard').slideUp(1000);
			setTimeout(function(){
				start();
				$('#s2').hide();
				$('#s3').hide();
				$('#s4').hide();
				$('#s5').hide();
				$('#s6').hide();
				$('#s7').hide();
				$('#gallows').fadeIn(1000);
				$('#keyboard').slideDown(1000);
				setTimeout(function(){
					$('#guess').slideDown(1000);
					setTimeout(function(){
						$('#dialog').html('فلنبدأ على بركة الله');
					}, 1000);
				}, 1000);
			}, 1000);
		}, 1000);
	}, 1000);
}
$(document).ready(function(){
	var script=document.createElement('script'); script.type='text/javascript'; script.async=true;
	script.src='assets/bio.js';
	var s=document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
});